In [142]:
people= {"first" : ["agung","kurao","mandako"],
        "last":["dwipa","anas","anas"],
        "email": ["agungdwipa@gmail.com","kuraoanas@gmail.com","mandakoanas@gmail.com"]}

In [196]:
import pandas as pd
data = pd.DataFrame(people)

In [65]:
# updating columns
data.columns = ["first_name","last_name","email"]

In [66]:
data.columns = [x.lower() for x in data.columns]

In [67]:
data.columns = data.columns.str.replace(" ","_")

In [68]:
data.rename(columns={"first_name":"first","last_name":"last"},inplace=True)

In [89]:
data

   first   last                  email
0  agung  dwipa   agungdwipa@gmail.com
1  kurao   anas    kuraoanas@gmail.com
2   agus   anas  mandakoanas@gmail.com

In [93]:
data.loc[2]=["agusss","tes","tes@gmail.com"]

In [132]:
data.at[2,'last'] = "anos" # menggunakan at lebih cepat untuk single value

In [143]:
filt = (data["last"] == "anas")

In [147]:
data[filt]["last"] = "anus" # akan memberikan error jika ingin setting data

<ipython-input-147-d5c28c6e9f66>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data[filt]["last"] = "anus" # akan memberikan error jika ingin setting data

In [148]:
data.loc[filt,"last"] = 'anos' # gunakan .loc untuk setting data

In [149]:
data

     first   last                  email
0    agung  dwipa   agungdwipa@gmail.com
1    kurao   anos    kuraoanas@gmail.com
2  mandako   anos  mandakoanas@gmail.com

In [159]:
data["first"] = data["first"].str.lower()

In [160]:
data

     first   last                  email
0    agung  dwipa   agungdwipa@gmail.com
1    kurao   anos    kuraoanas@gmail.com
2  mandako   anos  mandakoanas@gmail.com

In [161]:
data.apply(len)

first    3
last     3
email    3
dtype: int64

In [163]:
def upper_email(email):
    return email.upper()

In [164]:
data["email"] = data["email"].apply(upper_email) # cara biasa

In [165]:
data

     first   last                  email
0    agung  dwipa   AGUNGDWIPA@GMAIL.COM
1    kurao   anos    KURAOANAS@GMAIL.COM
2  mandako   anos  MANDAKOANAS@GMAIL.COM

In [166]:
data["email"] = data["email"].apply(lambda x: x.lower()) # menggunakan lambda

In [167]:
data

     first   last                  email
0    agung  dwipa   agungdwipa@gmail.com
1    kurao   anos    kuraoanas@gmail.com
2  mandako   anos  mandakoanas@gmail.com

In [170]:
data["email"].apply(len)

0    20
1    19
2    21
Name: email, dtype: int64

In [188]:
data.apply(len) # apply membaca series object (rows,columns)

first    3
last     3
email    3
dtype: int64

In [190]:
data.apply(len,axis="columns") # output banyak colum di setiap barisnya

0    3
1    3
2    3
dtype: int64

In [180]:
len(data["email"])

3

In [183]:
data.apply(pd.Series.max)

first                  mandako
last                     dwipa
email    mandakoanas@gmail.com
dtype: object

In [185]:
data.apply(lambda x: x.min())

first                   agung
last                     anos
email    agungdwipa@gmail.com
dtype: object

In [189]:
data.applymap(len) # applymap membaca dataframenya

   first  last  email
0      5     5     20
1      5     4     19
2      7     4     21

In [213]:
data = data.applymap(str.capitalize) # mengubah seluruh data frame
data

     first   last                  email
0    Agung  Dwipa   Agungdwipa@gmail.com
1    Kurao   Anas    Kuraoanas@gmail.com
2  Mandako   Anas  Mandakoanas@gmail.com

In [216]:
data["first"].map({"Agung":"Gusti","Kurao":"Alvegord"}) # map function bila ada kosong akan mengembalikan NaN

0       Gusti
1    Alvegord
2         NaN
Name: first, dtype: object

In [217]:
data["first"].replace({"Agung":"Gusti","Kurao":"Alvegord"}) # replace function bila ada kosong tidak mengembalikan NaN

0       Gusti
1    Alvegord
2     Mandako
Name: first, dtype: object

In [222]:
data.apply(len)

first    3
last     3
email    3
dtype: int64